Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: When he saw me, he pretended to be asleep.
hi: मुझे देखने पर उसने सोने का ढोंग किया।

source: I'm fine.
hi: मैं ठीक हूँ।

source: I bought an old car.
hi: मैंने पुरानी गाड़ी खरीदी।

source: I have been writing letters all morning.
hi: मैं पूरी सुबह से चिट्ठियाँ लिख रहा हूँ।

source: I chose to leave instead of staying behind.
hi: मैंने रहने की बजाय जाने का इरादा किया।

source: I'm a government worker.
hi: मैं सरकारी कर्मचारी हूँ।

source: I had the good fortune to succeed.
hi: मैं खुशकिसमत था कि सफ़ल हो गया।

source: I want to live a happy life.
hi: मैं सुखभरी ज़िन्दगी जीना चाहता हूँ।

source: I went there because I wanted to.
hi: मैं वहाँ गया क्योंकि मेरा मन था।

source: I'm at the airport now.
hi: मैं अभी हवाईअड्डे में हूँ।

source: I took a walk with my dog this morning.
hi: आज प्रात मैंने अपने कुत्ते के साथ सैर की.

source: I have caught a cold.
hi: मुझे ज़ुकाम हो गया है।

source: I haven't seen him lately.
hi: मैंने उसे हाल में नहीं देखा है।

source: I couldn't recognize her at first.
hi: पहले तो मैं उसे पहचान ही नहीं पाया।

source: I left the keys with my wallet.
hi: मैंने चाबियों को अपने बटुए के साथ छोड़ दिया।

source: I received a letter in English yesterday.
hi: कल मुझे अंग्रेजी में एक पत्र मिला।

source: I fixed the car yesterday.
hi: मैंने गाड़ी को कल ठीक किया था।

source: I met Mary yesterday.
hi: मैं कल मेरी से मिला था।

source: I was in bed all day long yesterday.
hi: कल मैं पूरे दिन बिस्तर में था।

source: I met your father yesterday.
hi: मैं कल तुम्हारे पिताजी से मिला।

source: I had a strange dream last night.
hi: मुझे कल रात एक बहुत अजीब सपना आया।

source: I cannot tolerate noisy children.
hi: मैं शोर मचाते हुए बच्चों को झेल नहीं सकता।

source: I made the fact known to all my friends.
hi: मैंने अपने सारे दोस्तों को इस बात के बारे में बता दिया था।

source: I would sometimes travel abroad alone.
hi: मैं कभी-कभार अकेले विदेश सफ़र करने जाता था।

source: I admit my mistake.
hi: मैं अपनी ग़लती मानता हूँ।

source: I am tired of my work.
hi: मैं अपने काम से थक चुका हूँ।

source: I know how to drive a car.
hi: मुझे गाड़ी चलाना आता है।

source: I am able to drive a car.
hi: मैं गाड़ी चला सकता हूँ।

source: I visit my grandmother twice a week.
hi: मैं अपनी नानी से हफ़्ते में दो बार मिलने जाता हूँ।

source: I have lots of work to clear up by the weekend.
hi: मुझे इस हफ़्ते बहुत सारा काम कर के खतम करना है।

source: I'm busy with my homework.
hi: मैं अपने होमवर्क में लगा हुआ हूँ।

source: I have not asked for help, nor do I desire it.
hi: न मैंने मदद माँगी है, न मैं मदद चाह्ता हूँ।

source: I have some money.
hi: मेरे पास कुछ पैसे हैं।

source: I laughed.
hi: मैं हँसा।

source: I overslept.
hi: मैं ज़्यादा सो गया।

source: I think that Shintaro speaks English well.
hi: मुझे लगता है के शिन्तारो अंग्रेज़ी अच्छी तरह बोल लेता है।

source: I want to buy a new computer.
hi: मैं एक नया कम्प्यूटर खरीदना चाहता हूँ।

source: I am really pleased with my new car.
hi: मैं अपनी नई गाड़ी से बहुत खुश हूँ।

source: I am poor at swimming.
hi: मुझे ढंग से तैरना नहीं आता।

source: I like maths.
hi: मुझे गणित पसंद है।

source: I am weak in mathematics.
hi: मैं गणित में कमज़ोर हूं।

source: I'm not a student.
hi: मैं विद्यार्थी नहीं हूँ।

source: I like red roses.
hi: मुझे लाल गुलाब पसंद हैं।

source: I wanted red shoes.
hi: मुझे जूते चाहिए थे।

source: I've lost my ticket.
hi: मेरी टिकट खो गई है।

source: I was in London last month.
hi: मैं पिछले महीने लंदन में था।

source: My boss made me work last Sunday.
hi: मेरे बॉस ने मुझसे पिछले रविवार को काम करवाया।

source: I dived into the river.
hi: मैंने नदी में छलाँग लगाकर डुबकी ली।

source: I like cats best of all animals.
hi: सभी जानवरों में से मुझे बिल्लियां सबसे ज्यादा पसंद हैं.

source: I was able to answer all the questions.
hi: मैं सारे सवालों का जवाब दे पाया था।

source: I got up early, so that I could catch the first train.
hi: मैं जल्दी उठा था, क्योंकि मुझे पहली ट्रेन पकड़नी थी।

source: I'm able to run.
hi: मैं दौड़ सकता हूँ।

source: I don't mind waiting.
hi: मुझे प्रतीक्षा करने में कोई आपत्ती नहीं है।

source: I am ashamed of having been lazy.
hi: मुझे अपने आलसी होने पर शर्म आती है।

source: I was born in Osaka.
hi: मैं ओसाका में पैदा हुआ।

source: I live in a big city.
hi: मैं बड़े शहर में रहता हूँ।

source: I don't like the polluted atmosphere of big cities.
hi: मुझे बड़े शहरों का प्रदूषित वातावरण अच्छा नहीं लगता।

source: I don't know who wrote this letter.
hi: मुझे नहीं पता कि यह चिट्ठी किसने लिखी है।

source: I have to learn many words and phrases by heart.
hi: मुझे बहुत सारे शब्दों और वाक्यांशों को रटना है।

source: I refused absolutely.
hi: मैंने सरासर इनकार कर दिया।

source: I go to school by subway.
hi: मैं मेट्रो लेकर स्कूल जाती हूँ।

source: I came to Japan from China.
hi: मैं चीन से जापान आया।

source: I haven't got in touch with him for a long time.
hi: मेरा उसके साथ काफ़ी देर से सम्पर्क नहीं हुआ है।

source: I was kept waiting for a long time at the hospital.
hi: अस्पताल में मुझसे बहुत देर तक इन्तज़ार करवाया गया।

source: I raise a variety of roses in the garden.
hi: मैं अपने उद्यान में कई प्रकार के गुलाब उगाता हूँ।

source: I really like city life.
hi: मुझे शहर की ज़िन्दगी पसंद है।

source: I often catch cold in winter.
hi: मुझे सर्दियों में अक्सर बुखार हो जाता है।

source: I felt like running away.
hi: मेरा भाग जाने का मन हुआ।

source: I will never do it again.
hi: मैं फिरसे नहीं करूँगा।

source: I am going to stay here for a couple of days.
hi: मैं यहाँ एक-दो दिन रहूँगा।

source: I'm standing in the shade.
hi: मैं छाया में खड़ा हूँ।

source: I live in Japan.
hi: मैं जापान में रहता हूँ।

source: It is forty years since I began the study of Japanese.
hi: अब चालीस साल हो गए हैं मेरी जापानी की पढ़ाई को शुरू किए हुए।

source: I clean up my room every Sunday.
hi: मैं हर रविवार अपना कमरा साफ़ करता हूँ।

source: I'm never at home on Sundays.
hi: में रविबार को कभी घर पे नहीं होता.

source: I work every day except Sunday.
hi: मैं रविवार के अलावा हर रोज काम करता हूं।

source: I have a bad pain in my back.
hi: मुझे पीठ में बुरी तरह से दर्द हो रहा है।

source: I've got a bit of an ache in my back.
hi: मेरी पीठ में थोड़ा दर्द हो रहा है।

source: I'm only a customer.
hi: मैं तो बस एक ग्राहक हूँ।

source: I don't know when he will come.
hi: मुझे नहीं पता वह कब आएगा।

source: I don't know if he knows it.
hi: मुझे नहीं पता कि उसको पता है कि नहीं।

source: I am convinced that he did nothing wrong.
hi: मुझे पूरा विश्वास है कि उसने कोई भी ग़लत काम नहीं किया।

source: I couldn't make out what he wanted to say.
hi: मैं समझ नहीं पा रहा था कि वह कहना क्या चाहता था।

source: I was afraid he might die.
hi: मुझे उसके मरने का डर था।

source: I saw him crossing the road.
hi: मैंने उसे सड़क पार करते हुए देखा।

source: I am confident he will keep his promise.
hi: मुझे भरोसा है कि वह अपना वादा निभाएगा।

source: I accompanied him on the trip.
hi: मैं सफ़र पर उसके साथ गया।

source: I explained the rule to him.
hi: मेने उसे नियम समझाया।

source: I gave him a gold watch.
hi: मैंने उसे एक सोने की घड़ी दी।

source: I will have him mend my shoes.
hi: मैं अपने जूते उससे ठीक करवाऊँगा।

source: I gave him what money I had.
hi: मेरे पास जो भी पैसे थे मैंने उसे दे दिए।

source: I believe whatever he says.
hi: वह जो भी कहे, मुझे उस पर यकीन है।

source: I did it the way he told me to.
hi: उसने जैसे बताया था मैंने वैसे किया।

source: I know his address.
hi: मुझे उसका पता पता है।

source: I know his address, but it's a secret.
hi: मुझे उसका पता पता है, पर वह एक राज़ है।

source: I could not but laugh at his joke.
hi: मैं उसके मज़ाक पर बस हँस पड़ा।

source: I was surprised at the news of his sudden death.
hi: मैं उसकी अचानक मौत की खबर से चौंक गया।

source: I am his friend and will remain so.
hi: मैं उसका दोस्त हूँ और रहूँगा।

source: I cannot stand his arrogance any longer.
hi: मैं उसके अक्खड़पन अब और बर्दाश्त नहीं कर सकता।

source: He can play the piano better than I.
hi: वह पियानो मुझसे अच्छा बजाता है।

source: I know both of them.
hi: मैं दोनो को जानता था।

source: I made him my servant.
hi: मैंने उसे अपना नौकर बना लिया।

source: I help him.
hi: मैं उसकी मदद करता हूँ।

source: I tried to persuade him, but in vain.
hi: मैने उसे मनाने की कोशिश की, लेकिन सब बेकार ही गया।

source: I have made him angry.
hi: मैंने उसे गुस्सा कर दिया है।

source: I received a letter which was written by her.
hi: मुझा उसकी लिखी हुई एक चिट्ठी मिली।

source: I accompanied her on a walk.
hi: मैं उसके साथ सैर के लिए गया।

source: I'd like to see her.
hi: मैं उसे देखना चाहूँगा।

source: I informed her of my success.
hi: मैंने उसको अपनी कामयाबी के बारे में बताया।

source: I was worried on her account.
hi: मैं उसके लिए परेशान था।

source: I caught a glimpse of her.
hi: मुझे उसकी झलक दिखाई दी।

source: I caught a beautiful butterfly.
hi: मैने एक सुंदर तितली को पकड़ लिया।

source: I am poor, whereas my brothers are very rich.
hi: मैं ग़रीब हूँ, पर मेरे भाई बहुत अमीर हैं।

source: I am nothing but a poor peasant.
hi: मैं तो बस एक गरीब किसान ही हूँ।

source: I usually get home by six o'clock.
hi: मैं आमतौर पर छः बजे तक घर आ जाता हूँ।

source: I usually get up at eight.
hi: मैं आमतौर पर आठ बजे उठा करता हूँ।

source: I'm not ashamed of my father being poor.
hi: मुझे अपने पिता की ग़रीबी पर शर्म नहीं आती है।

source: I pricked up my ears.
hi: मैंने ध्यान से सुना।

source: I go to school on foot.
hi: मैं स्कूल चल कर जाती हूँ।

source: I've never heard my mother sing a song.
hi: मैंने कभी भी अपनी मां को गाना गाते हुए नहीं सुना।

source: I helped my mother wash the dishes.
hi: मैंने अपनी मम्मी को बर्तन धोने में मदद करी।

source: I'm waiting for my mother.
hi: मैं अपनी माँ का इंतेज़ार कर रहा हूँ।

source: I go to work by car every day.
hi: में रोज कार से दफ्तर जाता हूं.

source: I run every day.
hi: मैं रोज़ दौड़ने जाता हूँ।

source: I keep my diary every day.
hi: मैं हर रोज़ अपनी डायरी में लिखती हूँ।

source: I will go to America tomorrow.
hi: मैं कल अमेरिका जाऊँगी।

source: I will come back to Canada tomorrow.
hi: मैं कल कनाडा वापस आऊँगा।

source: I will call on him tomorrow.
hi: मैं कल उससे मिलने जाऊँगा।

source: I'll come back.
hi: मैं वापस आऊँगा।

source: I have a few friends.
hi: मेरे पास कुछ दोस्त हैं।

source: I make it a practice to help my brother with his homework after supper.
hi: मुझे रात को खाना खाने के बाद अपने भाई को उसके होमवर्क के साथ मदद करने की आदत है।

source: I'll go to Hokkaido next month with my friend.
hi: मैं अगले महीने मेरे दोस्त के साथ होक्काइदो जाउँगा।

source: I am going to go to America next year.
hi: अगले साल मैं अमरीका जाने वाला हूँ।

source: I spent hours looking for the key that I had dropped.
hi: मैं घंटों तक उस चाबी को ढूँढता रहा जिसे मैंने गिरा दिया था।

source: I bought a few eggs and a little milk.
hi: मैंने कुछ अंडे और थोडा दूध खरीदा.

source: I like both science and math.
hi: मुझे विज्ञान और गणित दोनों पसंद हैं।

source: I like history.
hi: मुझे इतिहास पसंद है।

source: I'm interested in history.
hi: मुझे इतिहास में दिलचस्पी है।

source: I want somebody to talk to.
hi: मुझें बात करने के लिये कोई चाहिये।

source: Won't you join us for dinner?
hi: हमारे साथ (रात का) खाना खाएँगे ना?

source: Our country produces a lot of sugar.
hi: हमारा देश बहुत सारी चीनी उत्पादित करता है।

source: Don't worry about us.
hi: हमारी चिंता मत करो।

source: We are sorry we can't help you.
hi: माफ़ कीजिए पर हम आपकी मदद नहीं कर सकते।

source: We need the money.
hi: हमें उस पैसे की ज़रूरत है।

source: We all laughed at his joke.
hi: हम सब उसके मज़ाक पर हँसे।

source: We managed to swim across the river.
hi: हम नदी को तैरकर पार कर पाए।

source: We can never get rid of the past.
hi: हम बीते हुए कल से नहीं छिप सकते।

source: We're in a hurry.
hi: हम जल्दी में हैं।

source: We celebrated his birthday.
hi: हमने उसका जन्मदिन मनाया।

source: We call him Mike.
hi: हम उसे माईक बुलाते हैं।

source: Poets write poems.
hi: कवी कविताएँ लिखते हैं।

source: You'll have to work hard if you want to pass the exam.
hi: अगर तुम्हे परीक्षा पास करनी है तो मन लगाकर काम करना होगा।

source: The examination compelled me to study hard.
hi: मुझे परीक्षा ने ख़ूब पड़ने के लिए मजबूर किया।

source: Where is the changing room?
hi: कपड़े बदलने का कमरा कहाँ पर है?

source: What's the story?
hi: क्या कहानी है?

source: She felt less sad as time passed.
hi: जैसे जैसे समय बीतता गया, उसके दुख का अहसास भी कम होता गया।

source: Time flies.
hi: वक़्त उड़ता है।

source: Time goes by quickly.
hi: समय तेज़ी से बीतता है।

source: The clock has just struck three.
hi: घड़ी पर अभी अभी तीन बजे हैं।

source: A clock has two hands.
hi: घड़ी के दो हाथ होते हैं.

source: I must adjust my watch. It's slow.
hi: मुझे अपनी घड़ी ठीक करनी है। धीरे चल रही है।

source: Sometimes she tried talking to him about India.
hi: वह कभी-कभी उससे भारत की बात करने की कोशिश किया करती थी।

source: He is digging his own grave.
hi: वह अपनी क़ब्र खोद रहा है।

source: It'll cure itself naturally.
hi: वह अपने-आप ठीक हो जाएगा।

source: We should keep ourselves clean.
hi: हमें अपने आप को साफ़ रखना चाहिए।

source: Go tell him yourself.
hi: उसको अपने-आप जाकर बताओ।

source: Few people will admit their faults.
hi: बहुत कम लोग अपनी गलतियों को मानते हैं।

source: Go about your business!
hi: जाओ अपना काम करो!

source: Keep your room as neat as you can.
hi: अपना कमरा जितना साफ़-सुथरा रख सकते हो रखो।

source: To know oneself is very difficult.
hi: अपने-आप को जानना बहुत ही कठिन होता है।

source: Without a dictionary, it would be hard to study English.
hi: शब्दकोश (डिक्शनरी) के बिना अंग्रेज़ी की पढ़ाई करना बहुत मुश्किल होगा।

source: Look up the phrase in your dictionary.
hi: शब्दकोश में उस वाक्यांश को ढूँढो।

source: The dictionary is close at hand.
hi: शब्दकोष पास में ही है।

source: The deer was running by itself.
hi: हिरण अकेले दौड़ रहा था।

source: I beg to differ with you.
hi: माफ़ किजिए, पर मैं आपसे सहमत नहीं हूँ।

source: As a matter of fact, I dislike him.
hi: दरअसल मुझे वह पसंद नहीं है।

source: To tell the truth, I don't like his way of talking.
hi: सच कहूं तो मुझे उसका बात करने का तरीका पसंद नहीं आया।

source: His failure was in reality due to his lack of care.
hi: असलियत में उसकी नाकामयाबी उसकी लापरवाही की वजह से थी।

source: Can you identify the man in this picture?
hi: क्या तुम उस आदमी को उसकी तस्वीर से पहचान सकते हो?

source: The car broke down on the way to the airport.
hi: एयरपोर्ट के रास्ते पर गाड़ी खराब हो गई।

source: Let's go by car.
hi: कार से चलते हैं.

source: Drive carefully.
hi: ध्यान से गाड़ी चला।

source: Do you know how to drive a car?
hi: क्या आपको गाड़ी चलाना आता है?

source: The car raised a cloud of dust.
hi: उस गाड़ी ने बहुत धूल उड़ाई।

source: The car hit a telephone pole.
hi: गाड़ी फ़ोन के खम्बे से जाकर भिड़ पड़ी।

source: How many cars do you have?
hi: आपके पास कितनी गाड़ियाँ हैं?

source: You should work hard while you are young.
hi: जवान हो तब तक तुम्हें कड़ी मेहनत से काम करना चाहिए।

source: My hands are dirty. I have been repairing my bicycle.
hi: मेरे हाथ गंदे हैं। मैं अपनी साईकल ठीक कर रहा था।

source: Put your hands up!
hi: हाथ ऊपर करो!

source: Wash your hands well.
hi: अपने हाथ अच्छे से धोओ।

source: Please remind me to post the letters.
hi: मुझे चिट्ठियों को डाक में डालने की याद दिलाना।

source: I can't turn my neck, because it hurts a lot.
hi: मैं अपनी गर्दन नहीं घुमा सकता क्योंकि बहुत दर्द होता है।

source: School begins at half past eight.
hi: स्कूल साढ़े-आठ बजे शुरू होता है।

source: School begins at 8:30 a.m.
hi: स्कूल साढ़े-आठ बजे शुरू होता है।

source: The seventh day of the week is Saturday.
hi: हफ़्ते का सातवा दिन शनिवार है।

source: Can I extend my stay one more night?
hi: मैं एक रात और रह सकता हूँ क्या?

source: Don't you want to go out?
hi: बाहर नहीं जाना चाहते हो क्या?

source: Let me out!
hi: मुझे बाहर जाने दो!

source: Get out!
hi: बाहर निकल जाओ!

source: The gate was left open.
hi: गेट को खुला छोड़ दिया गया था।

source: I will pay my debt as soon as possible.
hi: मैं अपना कर्ज़ जल्द-से-जल्द चुकताऊँगा।

source: I'll try to finish it in time as best I can.
hi: मैं उसे जितना हो सकेगा उतना समय में खतम करने की कोशिश करूँगा।

source: It was so nice to sit on the grass in the spring sun.
hi: सावन की धूप में घास पर बैठना कितना अच्छा लगता है।

source: We should abolish the death penalty.
hi: हमें मृत्यु दंड का निर्मूलन करना चाहिए।

source: Have you been here before?
hi: तुम यहाँ पहले आए हुए हो क्या?

source: He could not sleep because of the heat.
hi: वह गर्मी की वजह से सो नहीं पाया।

source: Will you hand the papers around?
hi: क़ागज़ों को बाँट दोगे क्या?

source: A woman's strength is in her tongue.
hi: औरत की ताकत उसकी जीभ में होती है।

source: It is said that women live longer than men.
hi: कहा जाता है कि औरतों की उम्र आदमियों से ज़्यादा लम्बी होती है।

source: By degrees the friendship between him and her grew into love.
hi: थोड़े थोड़े से, उनके बीच की दोस्ती प्यार में बदल गई।

source: I'm looking for a small suitcase.
hi: मैं एक छोटी अटैची को ढूँढ रहा हूँ।

source: It's too small.
hi: कुछ ज़्यादा ही छोटा है।

source: An umbrella is useful in a mild rain, but when it rains cats and dogs an umbrella is of little help.
hi: कम बारिश में छाते का उपयोग किया जाता है, मगर भारी बारिश होने पर छाते का कम उपयोगी होता है।

source: Please speak in a low voice.
hi: कृपया धीमी आवाज़ में बात कीजिए।

source: May I speak to you a minute?
hi: में आपसे एक क्षण के लिए बात कर सकता हूं?

source: Would you just move along a bit, please?
hi: आप थोड़ा आगे खिसक सकते हैं क्या?

source: You might at least say thank you.
hi: कम से कम शुक्रिया तो कह सकते हो।

source: The girl looked around.
hi: उस लड़की ने पीछे मुड़कर देखा।

source: The girl was aware of the danger.
hi: उस लड़की को खतरे के बारे में पता था।

source: The girl tried hard to hold back her tears.
hi: उस लड़की ने अपने आँसुओं को रोकने की बहुत कोशिश करी।

source: The boy stripped off his clothes.
hi: उस लड़के ने अपने सारे कपड़े उतारे।

source: The boy gathered a handful of peanuts and put them in a small box.
hi: उस लड़के ने एक मुट्ठीभर मूँगफलियाँ लीं और उन्हें एक छोटे से डब्बे में डाल दिया।

source: The boy ran away when he saw me.
hi: लड़का मुझको देखते ही भाग गया।

source: Get down!
hi: उतर!

source: Seicho Matumoto died in 1992.
hi: सेइचो मात्सुमोतो का निधन सन १९९२ में हुआ।

source: Elephants live in Asia and Africa.
hi: हाथी एशिया और अफ़्रीका में रहते हैं।

source: An elephant is a very large animal.
hi: हाथी एक बहुत बड़ा जानवर होता है।

source: Has the bell rung yet?
hi: घंटी बज चुकी है क्या?

source: My boss will not say 'yes'.
hi: मेरे बॉस "हाँ" नहीं कहेंगे।

source: Please get in.
hi: कृपया अंदर आईए।

source: I missed my stop. How long does it take to reach the next stop?
hi: मेरा स्टॉप छूट गया। अगला स्टॉप कितनी देर में आएगा?

source: The situation calls for drastic measures.
hi: इस परिस्थिति में कठोर कदम उठाने होंगे।

source: I am afraid of the situation getting worse.
hi: मुझे परिस्तिथि के बदतर होने का डर है।

source: The food is getting cold.
hi: खाना ठंडा हो रहा है।

source: He finished his dinner because he didn't like to waste food.
hi: उसे खाने की बर्बादी करना पसंद नहीं था, तो उसने अपना खाना खाकर खतम किया।

source: Brush your teeth after meals.
hi: खाना खाने के बाद दाँतों को साफ़ करो।

source: Won't you come to dine with us?
hi: क्या आप हमारे साथ खाना खाने नहीं आएंगे?

source: Wash your hands before meals.
hi: खाना खाने से पहले अपने हाथ धोओ।

source: Lack of food made them very hungry.
hi: खाने की कमी ने उन्हें बहुत भूका कर दिया।

source: Do you believe me?
hi: क्या तुम्हे मुझपर यकीन है?

source: Believe it or not, that is true.
hi: मानो या न मानो, यह तो सच है।

source: Unbelievable!
hi: अविश्वसनीय!

source: The signal turned from red to green.
hi: सिगनल की बत्ती लाल से हरी हो गई।

source: Don't worry. You can count on me.
hi: चिंता मत करो। तुम मुझपर भरोसा कर सकते हो।

source: Worrying deprived me of sleep last night.
hi: मुझे चिंता की वजह से कल रात नींद नहीं आई।

source: The new bridge was named Rainbow Bridge.
hi: नए ब्रिज को इन्द्रधनुष ब्रिज का नाम दिया गया।

source: The new government promised to rid the country of corruption.
hi: नई सरकार ने देश को भ्रष्टाचार से मुक्त करने का वादा किया।

source: The new model will be priced at $12,000.
hi: नये मॉडल की कीमत $१२,००० होगी।

source: I'm going to buy a new car.
hi: में एक नई कार खरीदूंगा।

source: Please let in some fresh air.
hi: कृपया ताज़ी हवा आने दो.

source: Fresh vegetables promote health.
hi: ताज़ी सब्ज़ियाँ स्वास्थ्य के लिए अच्छी होतीं हैं।

source: What the newspapers say is true.
hi: जो अखबार में लिखा है वह सच है।

source: In the woods, she met with two strangers.
hi: वह जंगल में दो अजनबियों से मिली।

source: Mariko studied not only English but also German.
hi: मारिको ने अंग्रेज़ी ही नहीं जर्मन भी पढ़ी थी।

source: Only God knows.
hi: भगवान जाने।

source: God helps those who help themselves.
hi: ईश्वर उनकी मदद करता है जो स्वयं की मदद करते हैं।

source: Kobe is the city which I was born in.
hi: कोबे वह शहर है जिसमें मैं पैदा हुआ था।

source: A gentleman would not spit on the street.
hi: कोई भी सुशील इनसान सड़क पर थूकेगा नहीं।

source: Children whose parents are dead are referred to as "orphans".
hi: जिन बच्चों के माता-पिता की मृत्यु हो गई होती है उने "अनाथ" बुलाया जाता है।

source: Opinions vary from person to person.
hi: हर इनसान की राय अलग होती है।

source: A man must work.
hi: एक आदमी के लिए काम करना ज़रूरी है।

source: You can know a man by his friends.
hi: आदमी को उसको दोस्तों से पहचाना जा सकता है।

source: Man's body is a sort of machine.
hi: इनसान का शरीर एक तरह की मशीन होती है।

source: Man is 70% water.
hi: आदमी सत्तर प्रतिशत पानी का बना हुआ है।

source: Humans can't live on Mars.
hi: इनसान मंगल पर नहीं रह सकतें।

source: A madman is not accountable for his actions.
hi: एक पागल इनसान को अपने किये-धरे के लिए ज़िम्मेदार नहीं ठहराया जा सकता।

source: The population is increasing.
hi: आबादी बढ़ रही है।

source: A woman picked my pocket in the crowd.
hi: भीड़ में एक औरत ने मेरी जेब काट ली।

source: Carrots contain a lot of vitamin A.
hi: गाजर में बहुत सारा विटामिन ए समाया होता है।

source: People were filled with fright.
hi: लोगों के दिल-व-दिमाग में भय भरा हुआ था।

source: Don't insult me in company.
hi: मुझे लोगों के सामने शर्मिंदा मत करो।

source: I can't swallow these tablets without a drink of water.
hi: मैं पानी के बिना इन गोलियों को निगल नहीं सकती।

source: I want some water.
hi: मुझे थोड़ा सा पानी चाहिए।

source: Water consists of hydrogen and oxygen.
hi: जल में उदजन व जारक होते है।

source: We have to buy water from Malaysia.
hi: हमें मलेशिया से पानी खरीदना पड़ता है।

source: Hydrogen and oxygen combine to form water.
hi: उदजन व जारक मिश्रण करके जल बनते है।

source: The water is running with great force.
hi: पानी बड़े वेग से बह रहा है.

source: The water pipe burst.
hi: पानी का पाइप फट गया।

source: Do you see a ship on the horizon?
hi: तुम्हें समुंदर के क्षितिज पर एक जहाज़ दिखाई दे रहा है क्या?

source: Nobody in the world wants war.
hi: दुनिया में कोई भी जंग नहीं चाहता।

source: Since the Industrial Revolution, the world population has more than tripled.
hi: औद्योगिक क्रांति के बाद से दुनिया की आबादी तीन गुना से भी ज़्यादा बढ़ गयी है।

source: The world's population tends to increase.
hi: दुनिया की आबादी बढ़ती रहती है।

source: The world is changing more and more quickly.
hi: दुनिया और-भी-और तेज़ी से बदल रही है।

source: You don't have to chat with them.
hi: तुम्हे उसने गप मारने की ज़रूरत नहीं है।

source: The unwise statement by the government caused prices to rise again.
hi: सर्कार के इस निर्बोध बयान से दाम फिर से बढ़ने लगे।

source: The government has been reforming education.
hi: सरकार शिक्षा को सुधारने मे लगी हुई है।

source: The government started a program to promote industry.
hi: सरकार ने उद्योग बढ़ाने के लिए कार्यक्रम शुरू किया।

source: The stars twinkled.
hi: तारे चमके।

source: The stars are glittering above.
hi: तारे ऊपर चमक रहें हैं।

source: Stars cannot be seen in the daytime.
hi: सितारे दिन में नहीं दिखते |

source: Do that which is right.
hi: जो सही है वो करो।

source: Tadashi has a soft voice.
hi: तादाशी की आवाज़ बहुत हल्की है।
